Revit 2027 API
RepeaterCoordinates(Int32, Int32) Constructor
 Creates two dimensional coordinates.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RepeaterCoordinates(
	int x,
	int y
)
Public Sub New (
	x As Integer,
	y As Integer
)
public:
RepeaterCoordinates(
	int x,
	int y
)
new :
        x : int *
        y : int -> RepeaterCoordinates
Parameters
x Int32
 The coordinate in first dimension.
y Int32
 The coordinate in second dimension.
See Also
Reference
RepeaterCoordinates Class
RepeaterCoordinates Overload
Autodesk.Revit.DB Namespace